-- phpMyAdmin SQL Dump
-- version 5.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Апр 25 2020 г., 12:55
-- Версия сервера: 10.4.11-MariaDB
-- Версия PHP: 7.4.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `quiz`
--

-- --------------------------------------------------------

--
-- Структура таблицы `answer`
--

CREATE TABLE `answer` (
  `answer_id` int(11) NOT NULL,
  `question_id` int(11) NOT NULL,
  `is_correct` int(11) NOT NULL,
  `answer_name` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `answer`
--

INSERT INTO `answer` (`answer_id`, `question_id`, `is_correct`, `answer_name`) VALUES
(371, 215, 0, ' унітарною'),
(372, 215, 0, 'суверенною'),
(373, 215, 1, 'цілісною і недоторканою'),
(374, 215, 0, 'суверенною та невідчужуваною'),
(375, 216, 1, 'політичної, економічної та ідеологічної багатоманітності;'),
(376, 216, 1, ' соціального плюралізму та багатоукладності економіки;'),
(377, 216, 1, 'відсутності цензури і поваги до приватної власності;'),
(378, 216, 1, 'поваги до культури Українського народу та культури національних\r\nменшин.'),
(379, 217, 1, ' військові формування, організація і порядок діяльності яких визначаються\r\nзаконом;'),
(380, 217, 1, ' Збройні Сили України;'),
(381, 217, 1, ' Збройні Сили України і інші військові формування;'),
(382, 217, 1, ' Службу безпеки України і правоохоронні органи держави.'),
(383, 218, 1, 'на підставі, в межах повноважень та у спосіб, передбачені Конституцією та\r\nзаконами України;'),
(384, 218, 0, 'з дотриманням принципів поваги до основоположних прав і свобод людини\r\nта неухильного дотримання законності;'),
(385, 218, 0, 'на підставах, у межах повноважень та у спосіб, що не заборонені\r\nКонституцією та законами України;'),
(386, 218, 0, 'на принципах верховенства права.'),
(387, 219, 1, 'не допускаються;'),
(388, 219, 0, 'допускаються у визначених Конституцією випадках;'),
(389, 219, 0, 'допускаються на підставі рішення Конституційного Суду України; '),
(390, 219, 0, 'допускаються у разі погодження з керівником вищого рівня.'),
(391, 220, 0, 'не мають зворотної дії;'),
(392, 220, 0, 'мають зворотну дію;'),
(393, 220, 1, 'не мають зворотної дії, окрім випадків коли вони помякшують чи\r\nскасовують відповідальність особи;'),
(394, 220, 0, 'мають зворотну дію в умовах надзвичайного та воєнного стану.'),
(395, 221, 0, 'всі правові акти органів влади'),
(396, 221, 0, 'розпорядчі акти органів державного управління, що визначають права і\r\nобовязки громадян'),
(397, 221, 1, 'закони та інші нормативно-правові акти, що визначають права і обовязки\r\nгромадян'),
(398, 221, 0, ' всі підзаконні нормативно-правові акти'),
(399, 222, 0, 'може бути позбавлений державою громадянства і висланий за межі\r\nУкраїни'),
(400, 222, 0, 'може бути позбавлений громадянства'),
(401, 222, 1, 'не може бути позбавлений громадянства'),
(402, 222, 0, ' може бути позбавлений лише політичних прав і свобод'),
(403, 223, 0, ' піклування'),
(404, 223, 0, 'надання допомоги'),
(405, 223, 1, 'піклування та захист'),
(406, 223, 0, 'захист'),
(407, 224, 0, 'кожен'),
(408, 224, 0, 'людина та громадянин'),
(409, 224, 1, 'громадянин'),
(410, 224, 0, 'громадянин України, який останні пять років мешкає на території України'),
(411, 225, 1, 'кожному'),
(412, 225, 0, 'громадянам України та особам без громадянства, які на законних підставах\r\nперебувають на території України'),
(413, 225, 0, 'громадянам України'),
(414, 225, 0, 'громадянам України та іноземцям'),
(415, 226, 0, ' усі фізичні особи'),
(416, 226, 1, 'громадяни України'),
(417, 226, 0, 'громадяни України та особи без громадянства, які на законних підставах\r\nперебувають на території України'),
(418, 226, 0, ' іноземці, які проживають в Україні останні 10 років');

-- --------------------------------------------------------

--
-- Структура таблицы `question`
--

CREATE TABLE `question` (
  `id` int(11) NOT NULL,
  `name` varchar(200) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `question`
--

INSERT INTO `question` (`id`, `name`) VALUES
(215, '1. Якою є територія України в межах існуючого кордону?'),
(216, ' 2.На яких засадах ґрунтується суспільне життя в Україні?'),
(217, '3.На кого покладається оборона України, захист її суверенітету,\r\nтериторіальної цілісності і недоторканості?'),
(218, '4. Як зобовязані діяти органи державної влади та органи місцевого\r\nсамоврядування, їх посадові особи?'),
(219, '5. Чи допускаються звуження змісту та обсягу існуючих прав і свобод при\r\nприйнятті нових законів або внесенні змін до чинних законів?'),
(220, '6. Чи мають зворотну дію у часі закони та інші нормативно правові\r\nакти?'),
(221, '7. Які акти мають бути доведені до відома населення у порядку,\r\nвстановленому законом?'),
(222, '8. Чи може громадянин України за дії, що дискредитують державу, бути\r\nпозбавлений громадянства?'),
(223, '9. Що гарантується Україною своїм громадянам, які перебувають за її\r\nмежами?'),
(224, '10. Хто має конституційне право на користування рівним правом доступу\r\nдо державної служби'),
(225, '11. Кому гарантується право на свободу думки і слова, на вільне\r\nвираження своїх поглядів і переконань?'),
(226, '12. Хто має право на участь в управлінні державними справами?');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `answer`
--
ALTER TABLE `answer`
  ADD PRIMARY KEY (`answer_id`);

--
-- Индексы таблицы `question`
--
ALTER TABLE `question`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `answer`
--
ALTER TABLE `answer`
  MODIFY `answer_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=426;

--
-- AUTO_INCREMENT для таблицы `question`
--
ALTER TABLE `question`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=229;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
